{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "unknown_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "unknown_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "128"}]}}}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_27", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_31", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "unknown_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/end", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "96"}]}}}}}, {"name": "unknown_34", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_36", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/end", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/strides", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_1/Mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_37", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/end", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/strides", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_41", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}}}, {"name": "unknown_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_44", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/begin", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/strides", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_45", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "3"}]}}}}}, {"name": "unknown_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d/Relu", "op": "_FusedConv2D", "input": ["input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d/Relu", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_1/Relu", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_2/Relu", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_3/Relu", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_4/Relu", "unknown_9", "unknown_10"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_5/Relu", "unknown_11", "unknown_12"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_6/Relu", "unknown_13", "unknown_14"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_7/Relu", "unknown_15", "unknown_16"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_8/Relu", "unknown_17", "unknown_18"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/add/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/conv2d_7/Relu", "StatefulPartitionedCall/functional_1/conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/re_lu/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/add/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_10/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/re_lu/Relu", "unknown_19", "unknown_20"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_11/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_10/Relu", "unknown_21", "unknown_22"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/add_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/re_lu/Relu", "StatefulPartitionedCall/functional_1/conv2d_11/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/add_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_12/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/re_lu_1/Relu", "unknown_23", "unknown_24"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_13/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_12/Relu", "unknown_25", "unknown_26"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/add_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/re_lu_1/Relu", "StatefulPartitionedCall/functional_1/conv2d_13/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/add_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_14/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/re_lu_2/Relu", "unknown_27", "unknown_28"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_15/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/conv2d_14/Relu", "unknown_29", "unknown_30"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/add_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/re_lu_2/Relu", "StatefulPartitionedCall/functional_1/conv2d_15/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/re_lu_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/add_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_16/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/re_lu_3/Relu", "unknown_31", "unknown_32"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_16/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape/Shape", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/strides"], "attr": {"end_mask": {"i": "0"}, "_cloned": {"b": true}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul/Mul/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/functional_1/conv2d_16/Relu", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul/Mul"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_17/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor/ResizeNearestNeighbor", "unknown_33", "unknown_34"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/add_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/conv2d_5/Relu", "StatefulPartitionedCall/functional_1/conv2d_17/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_18/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/add_4/add", "unknown_35", "unknown_36"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_18/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape_1/Shape_1", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/strides"], "attr": {"end_mask": {"i": "0"}, "_cloned": {"b": true}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_1/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_1/Mul_1/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_1/ResizeNearestNeighbor_1", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/functional_1/conv2d_18/Relu", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_1/Mul_1"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_19/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_1/ResizeNearestNeighbor_1", "unknown_37", "unknown_38"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_1/add_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/conv2d_3/Relu", "StatefulPartitionedCall/functional_1/conv2d_19/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_20/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/add_5/add", "unknown_39", "unknown_40"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape_2/Shape_2", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_20/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape_2/Shape_2", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_2/ResizeNearestNeighbor_2", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/functional_1/conv2d_20/Relu", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_21/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_2/ResizeNearestNeighbor_2", "unknown_41", "unknown_42"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1/add_6/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/conv2d_1/Relu", "StatefulPartitionedCall/functional_1/conv2d_21/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_22/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/add_6/add", "unknown_43", "unknown_44"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Shape_3/Shape_3", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/conv2d_22/Relu"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Shape_3/Shape_3", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/begin", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/end", "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "_cloned": {"b": true}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3/y"], "attr": {"T": {"type": "DT_INT32"}, "_cloned": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_3/ResizeNearestNeighbor_3", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/functional_1/conv2d_22/Relu", "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3"], "attr": {"_cloned": {"b": true}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/conv2d_23/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_ResizeNearestNeighbor_3/ResizeNearestNeighbor_3", "unknown_45", "unknown_46"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Tanh/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/conv2d_23/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/tf_op_layer_Tanh/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "unknown", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "unknown_0", "shape": [32], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "unknown_2", "shape": [32], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "unknown_4", "shape": [64], "dtype": "float32"}, {"name": "unknown_5", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "unknown_6", "shape": [64], "dtype": "float32"}, {"name": "unknown_7", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "unknown_8", "shape": [96], "dtype": "float32"}, {"name": "unknown_9", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "unknown_10", "shape": [96], "dtype": "float32"}, {"name": "unknown_11", "shape": [3, 3, 96, 128], "dtype": "float32"}, {"name": "unknown_12", "shape": [128], "dtype": "float32"}, {"name": "unknown_13", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_14", "shape": [128], "dtype": "float32"}, {"name": "unknown_15", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_16", "shape": [128], "dtype": "float32"}, {"name": "unknown_17", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_18", "shape": [128], "dtype": "float32"}, {"name": "unknown_19", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_20", "shape": [128], "dtype": "float32"}, {"name": "unknown_21", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_22", "shape": [128], "dtype": "float32"}, {"name": "unknown_23", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_24", "shape": [128], "dtype": "float32"}, {"name": "unknown_25", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_26", "shape": [128], "dtype": "float32"}, {"name": "unknown_27", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_28", "shape": [128], "dtype": "float32"}, {"name": "unknown_29", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_30", "shape": [128], "dtype": "float32"}, {"name": "unknown_31", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "unknown_32", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/begin", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/end", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice/strided_slice/strides", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul/Mul/y", "shape": [2], "dtype": "int32"}, {"name": "unknown_33", "shape": [3, 3, 128, 96], "dtype": "float32"}, {"name": "unknown_34", "shape": [96], "dtype": "float32"}, {"name": "unknown_35", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "unknown_36", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/begin", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/end", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_1/strided_slice_1/strides", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_1/Mul_1/y", "shape": [2], "dtype": "int32"}, {"name": "unknown_37", "shape": [3, 3, 96, 64], "dtype": "float32"}, {"name": "unknown_38", "shape": [64], "dtype": "float32"}, {"name": "unknown_39", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "unknown_40", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/begin", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/end", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_2/strided_slice_2/strides", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_2/Mul_2/y", "shape": [2], "dtype": "int32"}, {"name": "unknown_41", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "unknown_42", "shape": [32], "dtype": "float32"}, {"name": "unknown_43", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "unknown_44", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/begin", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/end", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_strided_slice_3/strided_slice_3/strides", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/tf_op_layer_Mul_3/Mul_3/y", "shape": [2], "dtype": "int32"}, {"name": "unknown_45", "shape": [3, 3, 32, 3], "dtype": "float32"}, {"name": "unknown_46", "shape": [3], "dtype": "float32"}]}]}